portfolio/artillery.yml
config:
  target: 'http://134.65.50.228:3000'
  phases:
    - duration: 60
      arrivalRate: 2
    - duration: 60  
      arrivalRate: 10
scenarios:
  - name: "Load test"
    flow:
      - get:
          url: "/"
      - get:
          url: "/imovel/BG6682001"
      - get:
          url: "/imoveis"